{
    "utils" : [
        {
            "id":1,
            "nom":"Nmap",
            "image":"/nmap.png",
            "description":"Nmap est un scanner de ports. Il permet d’analyser un serveur distant et de déterminer quels ports sont ouverts. Il lui sera également possible de recueillir des informations sur le système d’exploitation utilisé ainsi que sur les services hébergés.            ",
            "parametreslink":"https://nmap.org/book/man-briefoptions.html",
            "exemple":"sudo nmap -v -A -Pn (ip) [-v = verbose, -A = OS detection, -Pn = Treat all hosts as online]",
            "video":"https://www.youtube.com/watch?v=m84RjRcjUSM&ab_channel=Hafnium-S%C3%A9curit%C3%A9informatique",
            "linkdl":"https://nmap.org/",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":2,
            "nom":"Recon-ng",
            "image":"/reconng.png",
            "description":"Recon-ng est un outil puissant pour les développeurs travaillant en Python. L’outil est lui-même est écrit dans ce langage. Son interface ressemble beaucoup au framework populaire Metasploit, si bien que ceux qui connaissent déjà le framework n’auront pas de mal à se familiariser avec Recon-ng. L’outil dispose également d'une fonction d'aide interactive, absente de nombreux modules Python, ce qui devrait permettre aux développeurs de l'utiliser rapidement. Recon-ng automatise les activités OSINT qui prennent beaucoup de temps, comme le copier-coller. Recon-ng ne prétend pas réaliser toute la collecte OSINT, mais il peut être utilisé pour automatiser la plupart des collectes les plus populaires, libérant ainsi du temps pour les tâches qui ne peuvent être faites que manuellement.",
            "parametreslink":"https://www.kali.org/tools/recon-ng/",
            "exemple":"N/A check help from the interface",
            "video":"https://www.youtube.com/watch?v=T226hb3Trio&ab_channel=CryptoCat",
            "linkdl":"https://github.com/lanmaster53/recon-ng",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":3,
            "nom":"TheHarvester",
            "image":"/harvester.png",
            "description":"theHarvester est un script Python potentiellement très utile lors de la reconnaissance initiale dans une entreprise. Que ce soit quand vous effectuez un test d'intrusion en tant que professionnel de la cybersécurité ou quand un pirate lance une opération de reconnaissance aux premiers temps d'une attaque.",
            "parametreslink":"https://www.kali.org/tools/theharvester/",
            "exemple":"TheHarvester -d (domain) -b google.com [-d domain, -b source]",
            "video":"https://www.youtube.com/watch?v=bm7OXGdB-ag&ab_channel=LeSaisTu",
            "linkdl":"https://github.com/laramies/theHarvester",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":4,
            "nom":"Shodan",
            "image":"/shodan.jpg",
            "description":"Shodan est un site web spécialisé dans la recherche d'objets connectés à Internet, et ayant donc une adresse IP visible sur le réseau. Il permet ainsi de trouver une variété de serveurs web, de routeurs ainsi que de nombreux périphériques tels que des imprimantes ou des caméras. Une telle requête est traitée avec une simple analyse de l’entête HTTP renvoyée par l’appareil ou le serveur. Il est alors possible de récupérer des listes d'éléments spécifiques. Pour chaque résultat, on trouve l'adresse IP du serveur ainsi que d'autres types d'informations sensibles mais accessibles.",
            "parametreslink":"",
            "exemple":"voir site",
            "video":"https://www.youtube.com/watch?v=ehkRtFOniHk&ab_channel=OverShell",
            "linkdl":"https://www.shodan.io/",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":5,
            "nom":"OSINT Framework",
            "image":"/osint-framework.webp",
            "description":"Il s'agit d'un ensemble de techniques de recherche d'informations à partir de données ouvertes à tous. Il est principalement utilisé dans le cadre de la sécurité nationale ou de l'application de la loi.",
            "parametreslink":"",
            "exemple":"voir site",
            "video":"https://www.youtube.com/watch?v=97mUfPs8sZU&ab_channel=VIEHGroup",
            "linkdl":"https://osintframework.com/",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":6,
            "nom":"Dorking",
            "image":"/dorks.png",
            "description":"Le Google dorking sert à trouver des informations cachées qui ne sont normalement pas accessibles via une recherche Google normale. Les Google dorks peuvent révéler des informations sensibles ou privées sur les sites web et les entreprises, organisations et individus qui les détiennent et les exploitent.",
            "parametreslink":"voir vidéo en dessous",
            "exemple":"voir vidéo",
            "video":"https://www.youtube.com/watch?v=XaYEqNloSqQ&ab_channel=IT-Connect",
            "linkdl":"",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":7,
            "nom":"Sublist3r",
            "image":"/sublister.png",
            "description":"Sublist3r est un outil Python conçu pour énumérer les sous-domaines de sites Web utilisant OSINT. Il aide les testeurs d'intrusion et les chasseurs de bogues à collecter et à regrouper des sous-domaines pour le domaine qu'ils ciblent. Sublist3r énumère les sous-domaines à l'aide de nombreux moteurs de recherche tels que Google, Yahoo, Bing, Baidu et Ask. Sublist3r énumère également les sous-domaines utilisant Netcraft, Virustotal, ThreatCrowd, DNSdumpster et ReverseDNS.",
            "parametreslink":"https://www.securiteinfo.com/attaques/hacking/outils/sublist3r.shtml",
            "exemple":"voir vidéo",
            "video":"https://www.youtube.com/watch?v=OWblaOHjpAk&t=2s&ab_channel=HackinGeeK",
            "linkdl":"https://github.com/aboul3la/Sublist3r",
            "categories":[
                {
                    "id_categorie": 2,
                    "categoriename":"Enumération"
                }
            ]
        },
        {
            "id":8,
            "nom":"Gobuster",
            "image":"/gobuster-logo.svg",
            "description":"Gobuster est un outil développé en Go et disponible dans les dépôts officiels de Kali Linux. Actuellement à la version 3.1.0, il permet de faire bruteforce des: Répertoires et fichiers d’un site web, Sous domaines d’un domaine principal, Hôtes virtuelles (vhost) d’un serveur web, Buckets Amazon ouverts",
            "parametreslink":"https://www.kali-linux.fr/conseil/gobuster-le-bruteforce-de-pages-web",
            "exemple":"sudo gobuster dir -u (lien) -w (wordlist)",
            "video":"https://www.youtube.com/watch?v=n81GUEyHeJ8&ab_channel=NoobosaurusR3x",
            "linkdl":"https://github.com/OJ/gobuster",
            "categories":[
                {
                    "id_categorie": 2,
                    "categoriename":"Enumération"
                }
            ]
        },
        {
            "id":9,
            "nom":"Nikto",
            "image":"/Nikto.png",
            "description":"Nikto est un scanner de vulnérabilité en ligne de commande logiciel gratuit qui analyse les serveurs Web à la recherche de fichiers/CGI dangereux, de logiciels serveur obsolètes et d'autres problèmes.",
            "parametreslink":"https://doc.ubuntu-fr.org/nikto",
            "exemple":"nikto -h [URL]",
            "video":"https://www.youtube.com/watch?v=5r7FwvGLLTc&ab_channel=NoobosaurusR3x",
            "linkdl":"https://github.com/sullo/nikto",
            "categories":[
                {
                    "id_categorie": 2,
                    "categoriename":"Enumération"
                }
            ]
        },
        {
            "id":10,
            "nom":"SPARTA",
            "image":"/sparta.jpg",
            "description":"SPARTA est une application Python GUI qui simplifie les tests d'intrusion de l'infrastructure réseau en aidant le testeur d'intrusion dans la phase d'analyse et d'énumération. Il permet au testeur de gagner du temps en ayant un accès pointer-cliquer à sa boîte à outils et en affichant toutes les sorties de l'outil de manière pratique. Si peu de temps est consacré à la configuration des commandes et des outils, davantage de temps peut être consacré à l’analyse des résultats. Malgré les capacités d'automatisation, les commandes et outils utilisés sont entièrement personnalisables puisque chaque testeur a ses propres méthodes, habitudes et préférences.",
            "parametreslink":"check interface sparta ou legion",
            "exemple":"",
            "video":"https://www.youtube.com/watch?v=5lN2HN1OtqM",
            "linkdl":"https://github.com/SECFORCE/sparta",
            "categories":[
                {
                    "id_categorie": 2,
                    "categoriename":"Enumération"
                }
            ]
        }
    ]
}