{
    "utils" : [
        {
            "id":1,
            "nom":"Nmap",
            "image":"/nmap.png",
            "description":"Nmap est un scanner de ports. Il permet d’analyser un serveur distant et de déterminer quels ports sont ouverts. Il lui sera également possible de recueillir des informations sur le système d’exploitation utilisé ainsi que sur les services hébergés.            ",
            "parametreslink":"https://nmap.org/book/man-briefoptions.html",
            "exemple":"sudo nmap -v -A -Pn (ip) [-v = verbose, -A = OS detection, -Pn = Treat all hosts as online]",
            "video":"https://www.youtube.com/watch?v=m84RjRcjUSM&ab_channel=Hafnium-S%C3%A9curit%C3%A9informatique",
            "linkdl":"https://nmap.org/",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        },
        {
            "id":2,
            "nom":"Recon-ng",
            "image":"/reconng.png",
            "description":"Recon-ng est un outil puissant pour les développeurs travaillant en Python. L’outil est lui-même est écrit dans ce langage. Son interface ressemble beaucoup au framework populaire Metasploit, si bien que ceux qui connaissent déjà le framework n’auront pas de mal à se familiariser avec Recon-ng. L’outil dispose également d'une fonction d'aide interactive, absente de nombreux modules Python, ce qui devrait permettre aux développeurs de l'utiliser rapidement. Recon-ng automatise les activités OSINT qui prennent beaucoup de temps, comme le copier-coller. Recon-ng ne prétend pas réaliser toute la collecte OSINT, mais il peut être utilisé pour automatiser la plupart des collectes les plus populaires, libérant ainsi du temps pour les tâches qui ne peuvent être faites que manuellement.",
            "parametreslink":"https://www.kali.org/tools/recon-ng/",
            "exemple":"N/A check help from the interface",
            "video":"https://www.youtube.com/watch?v=T226hb3Trio&ab_channel=CryptoCat",
            "linkdl":"https://github.com/lanmaster53/recon-ng",
            "categories":[
                {
                    "id_categorie": 1,
                    "categoriename":"Reconnaissance"
                }
            ]
        }
    ]
}